uhnp/src/DataProcessors/тн_СозданиеКорректировокДвиженияПоОСИИНВ/тн_СозданиеКорректировокДвиженияПоОСИИНВ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_СозданиеКорректировокДвиженияПоОСИИНВ</name>
  <comment>//Блинова М.А. 15.08.2025 Выполнение задач №000054616</comment>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/AccumulationRegisters/АмортизацияОС/АмортизацияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АмортизацияОС</name>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияНУ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияПР</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияВР</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияНУЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияПРЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>АмортизацияВРЦФ</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценкиАмортизации</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>РезервПереоценкиАмортизацииРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ПериодНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаТекущийПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаПрошлыйПериод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаТекущийПериодБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РесурсВыработанныйЗаПрошлыйПериодБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизации</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДляВычисленияАмортизацииРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокОбесцененияУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокОбесцененияРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоначисление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДоначислениеБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУчетаУУ</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНА</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУчетаБУ</name>
    <type>
      <types>EnumRef.ПорядокУчетаВНА</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокНачисленияАмортизацииУУ</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокНачисленияАмортизацииБУ</name>
    <type>
      <types>EnumRef.ПорядокНачисленияАмортизации</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьИзнос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаВнеоборотныхАктивов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/AccumulationRegisters/ПрочиеРасходы/ПрочиеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПрочиеРасходы</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДД</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПрочихАктивов</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияВНалоговомОргане</name>
    <type>
      <types>CatalogRef.РегистрацииВНалоговомОргане</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.РаспределениеПрочихЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоляСтоимости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорАналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КорСтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетПартий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КорНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОбъектУчетаРезервов</name>
    <type>
      <types>CatalogRef.ОбъектыУчетаРезервовПредстоящихРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорВидРезервов</name>
    <type>
      <types>CatalogRef.Резервы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсточника</name>
    <type>
      <types>EnumRef.ВидыИсточниковДвижений</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасчета</name>
    <type>
      <types>DocumentRef.РегистраторРасчетаСебестоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимЗакрытияМесяца</name>
    <type>
      <types>EnumRef.РежимыЗакрытияМесяца</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Enums/ОперацииКорректировкиРегистров/ОперацииКорректировкиРегистров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииКорректировкиРегистров</name>
  <enumValues>
    <name>РучнаяКорректировка</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеРазрывовОстатковВзаиморасчетов</name>
  </enumValues>
  <enumValues>
    <name>ИсправлениеРазвернутогоСальдоВзаиморасчетов</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/DataProcessors/тн_СозданиеКорректировокДвиженияПоОСИИНВ/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьТЧНаСервере()
		
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для заполнения необходимо заполнить Период!",,,, Истина) ;
	КонецЕсли;
	
	Если  НЕ ЗначениеЗаполнено(Объект.Организация) Тогда  
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для заполнения необходимо заполнить Организацию!",,,, Истина)
	КонецЕсли;

    Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	АмортизацияОСОбороты.ОсновноеСредство КАК ОсновноеСредство
		|ИЗ
		|	РегистрНакопления.АмортизацияОС.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Запись,
		|			Организация = &Организация
		|				И ОсновноеСредство.тн_ПрименяемИнвестиционныйНалоговыйВычет) КАК АмортизацияОСОбороты
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(АмортизацияОСОбороты.Регистратор) = ТИП(Документ.АмортизацияОС2_4)";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	ОсновныеСредства = РезультатЗапроса.Выгрузить();
	Для Каждого СтрокаОС Из ОсновныеСредства Цикл
    // Ищем такое же значение в уже добавленных строках
	    НайденоДубль = Ложь;
	    Для Каждого СуществующаяСтрока Из Объект.ОсновныеСредства Цикл
	        Если СуществующаяСтрока.ОсновноеСредство = СтрокаОС.ОсновноеСредство Тогда
	            НайденоДубль = Истина;
	            Прервать;
	        КонецЕсли;
	    КонецЦикла;
	    
	    Если Не НайденоДубль Тогда
	        СтрокаТЧ = Объект.ОсновныеСредства.Добавить();
	        СтрокаТЧ.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
	    КонецЕсли;
	КонецЦикла;	
			
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТЧ(Команда)
	ЗаполнитьТЧНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументКорректировкаРегистровНаСервере()
	 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	КорректировкаРегистровтн_ЗаполнениеДвижений.Документ КАК Документ,
		|	КорректировкаРегистровтн_ЗаполнениеДвижений.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Корректировки
		|ИЗ
		|	Документ.КорректировкаРегистров.тн_ЗаполнениеДвижений КАК КорректировкаРегистровтн_ЗаполнениеДвижений
		|ГДЕ
		|	КорректировкаРегистровтн_ЗаполнениеДвижений.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
		|	И НЕ КорректировкаРегистровтн_ЗаполнениеДвижений.Ссылка.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	АмортизацияОС.ОсновноеСредство КАК ОсновноеСредство,
		|	АмортизацияОС.Организация КАК Организация,
		|	АмортизацияОС.АмортизацияВР КАК АмортизацияВР,
		|	АмортизацияОС.АмортизацияПР КАК АмортизацияПР,
		|	АмортизацияОС.Подразделение КАК Подразделение,
		|	АмортизацияОС.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
		|	АмортизацияОС.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	ПрочиеРасходы.СтатьяРасходов КАК СтатьяРасходов,
		|	ПрочиеРасходы.АналитикаРасходов КАК АналитикаРасходов,
		|	ПрочиеРасходы.ВременнаяРазница КАК ВременнаяРазница,
		|	ПрочиеРасходы.ПостояннаяРазница КАК ПостояннаяРазница,
		|	АмортизацияОС.Активность КАК Активность,
		|	АмортизацияОС.ВидДвижения КАК ВидДвижения,
		|	ПрочиеРасходы.ВидДвижения КАК ПрочиеРасходыВидДвижения,
		|	АмортизацияОС.НомерСтроки КАК НомерСтроки,
		|	АмортизацияОС.Регистратор КАК Регистратор,
		|	ЕСТЬNULL(ВТ_Корректировки.Ссылка, ЗНАЧЕНИЕ(Документ.КорректировкаРегистров.ПустаяСсылка)) КАК СсылкаКорректировки
		|ИЗ
		|	РегистрНакопления.АмортизацияОС КАК АмортизацияОС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
		|		ПО АмортизацияОС.ИдентификаторФинЗаписи = ПрочиеРасходы.ИдентификаторФинЗаписи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корректировки КАК ВТ_Корректировки
		|		ПО АмортизацияОС.Регистратор = ВТ_Корректировки.Документ
		|ГДЕ
		|	АмортизацияОС.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И АмортизацияОС.ОсновноеСредство В(&СписокОсновныхСредств)
		|	И ТИПЗНАЧЕНИЯ(АмортизацияОС.Регистратор) = ТИП(Документ.АмортизацияОС2_4)
		|	И АмортизацияОС.АмортизацияВР > 0
		|ИТОГИ
		|	МАКСИМУМ(СсылкаКорректировки)
		|ПО
		|	Регистратор";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата)); 
	МассивОсновныхСредств = Новый Массив;
	Для Каждого СтрокаОС Из Объект.ОсновныеСредства Цикл    
		Если СтрокаОС.Пометка Тогда  
			МассивОсновныхСредств.Добавить(СтрокаОС.ОсновноеСредство);
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокОсновныхСредств", МассивОсновныхСредств);
	
	РезультатЗапроса = Запрос.Выполнить();	
	  
	Если НЕ РезультатЗапроса.Пустой() Тогда     
		ВыборкаПоРегистратору = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаПоРегистратору.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаПоРегистратору.СсылкаКорректировки) Тогда
				ОбщегоНазначения.СообщитьПользователю("По документу " + ВыборкаПоРегистратору.Регистратор + " уже создана " + ВыборкаПоРегистратору.СсылкаКорректировки, ВыборкаПоРегистратору.СсылкаКорректировки);
			Иначе
			 НачатьТранзакцию();				
				Попытка
					ДокументКорректировкаРегистров = Документы.КорректировкаРегистров.СоздатьДокумент(); 
					ДокументКорректировкаРегистров.Операция = Перечисления.ОперацииКорректировкиРегистров.РучнаяКорректировка;
					ДокументКорректировкаРегистров.Дата = КонецМесяца(Объект.Дата);
					ДокументКорректировкаРегистров.Ответственный = Пользователи.ТекущийПользователь();
					ДокументКорректировкаРегистров.Комментарий = "Создано автоматически из обработки ""Создание корректировок движения по ОС и ИНВ (тн)"" за " +  Формат(Объект.Дата, "ДФ='MMMM yyyy ''г.'''"); 
					СтрокаСРегистром = ДокументКорректировкаРегистров.ТаблицаРегистров.Добавить(); 
					СтрокаСРегистром.Имя = "АмортизацияОС";
					СтрокаСРегистром = ДокументКорректировкаРегистров.ТаблицаРегистров.Добавить(); 
					СтрокаСРегистром.Имя = "ПрочиеРасходы";
					ДокументКорректировкаРегистров.тн_ИспользоватьЗаполнениеДвижений = Истина;
					СтрокаЗаполнения = ДокументКорректировкаРегистров.тн_ЗаполнениеДвижений.Добавить();
					СтрокаЗаполнения.Документ = ВыборкаПоРегистратору.Регистратор;
					ДокументКорректировкаРегистров.Записать();
					
					СторнируемыйНаборЗаписейАмортизации = РегистрыНакопления.АмортизацияОС.СоздатьНаборЗаписей();
					СторнируемыйНаборЗаписейАмортизации.Отбор.Регистратор.Установить(ДокументКорректировкаРегистров.Ссылка);
					
					СторнируемыйНаборЗаписейПрочихРасходов = РегистрыНакопления.ПрочиеРасходы.СоздатьНаборЗаписей();
					СторнируемыйНаборЗаписейПрочихРасходов.Отбор.Регистратор.Установить(ДокументКорректировкаРегистров.Ссылка);
					ВыборкаДетальныеЗаписи = ВыборкаПоРегистратору.Выбрать();
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						
						ДвижениеСторноАмортизации = СторнируемыйНаборЗаписейАмортизации.Добавить();
						ЗаполнитьЗначенияСвойств(ДвижениеСторноАмортизации, ВыборкаДетальныеЗаписи);
						ДвижениеСторноАмортизации.АмортизацияВР = - ВыборкаДетальныеЗаписи.АмортизацияВР;  
						ДвижениеСторноАмортизации.АмортизацияПР =   ВыборкаДетальныеЗаписи.АмортизацияВР;
						ДвижениеСторноАмортизации.Период        =   КонецМесяца(Объект.Дата);
						
						ДвижениеСторноПрочихРасходов = СторнируемыйНаборЗаписейПрочихРасходов.Добавить();
						ЗаполнитьЗначенияСвойств(ДвижениеСторноПрочихРасходов, ВыборкаДетальныеЗаписи);
						ДвижениеСторноПрочихРасходов.ВременнаяРазница  = - ВыборкаДетальныеЗаписи.ВременнаяРазница;  
						ДвижениеСторноПрочихРасходов.ПостояннаяРазница =   ВыборкаДетальныеЗаписи.ВременнаяРазница;
						ДвижениеСторноПрочихРасходов.Период            =   КонецМесяца(Объект.Дата);     
						ДвижениеСторноПрочихРасходов.ВидДвижения       =   ВыборкаДетальныеЗаписи.ПрочиеРасходыВидДвижения;
					КонецЦикла;
					
					СторнируемыйНаборЗаписейАмортизации.Записать();
					СторнируемыйНаборЗаписейПрочихРасходов.Записать();
					
					ОбщегоНазначения.СообщитьПользователю("Сформирован документ: " + ДокументКорректировкаРегистров, ДокументКорректировкаРегистров); 
					
					ЗафиксироватьТранзакцию();
					
				Исключение 
					
					ОтменитьТранзакцию();
					ТекстОшибки = "Документ " + ДокументКорректировкаРегистров +":" + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ЗаписьЖурналаРегистрации("Обработка ""Создание корректировок движения по ОС и ИНВ (тн)""", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
					ОбщегоНазначения.СообщитьПользователю("Возникли ошибки при корректировке движения по ОС и ИНВ." + ТекстОшибки);
					
				КонецПопытки; 
							 
			КонецЕсли;  
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументКорректировкаРегистров(Команда)
	СоздатьДокументКорректировкаРегистровНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьОперацияНаСервере()    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОперацияБухЗаполнениеДвижений.Документ КАК Документ,
	|	ОперацияБухЗаполнениеДвижений.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Операции
	|ИЗ
	|	Документ.ОперацияБух.ЗаполнениеДвижений КАК ОперацияБухЗаполнениеДвижений
	|ГДЕ
	|	ОперацияБухЗаполнениеДвижений.Ссылка.Организация = &Организация
	|	И ОперацияБухЗаполнениеДвижений.Ссылка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ ОперацияБухЗаполнениеДвижений.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйДвиженияССубконто.Период КАК Период,
	|	ХозрасчетныйДвиженияССубконто.Регистратор КАК Регистратор,
	|	ХозрасчетныйДвиженияССубконто.НомерСтроки КАК НомерСтроки,
	|	ХозрасчетныйДвиженияССубконто.Активность КАК Активность,
	|	ХозрасчетныйДвиженияССубконто.СчетДт КАК СчетДт,
	|	ХозрасчетныйДвиженияССубконто.Организация КАК Организация,
	|	ХозрасчетныйДвиженияССубконто.ВалютаДт КАК ВалютаДт,
	|	ХозрасчетныйДвиженияССубконто.ВалютаКт КАК ВалютаКт,
	|	ХозрасчетныйДвиженияССубконто.ПодразделениеДт КАК ПодразделениеДт,
	|	ХозрасчетныйДвиженияССубконто.ПодразделениеКт КАК ПодразделениеКт,
	|	ХозрасчетныйДвиженияССубконто.НаправлениеДеятельностиДт КАК НаправлениеДеятельностиДт,
	|	ХозрасчетныйДвиженияССубконто.НаправлениеДеятельностиКт КАК НаправлениеДеятельностиКт,
	|	ХозрасчетныйДвиженияССубконто.СуммаПРДт КАК СуммаПРДт,
	|	ХозрасчетныйДвиженияССубконто.СуммаПРКт КАК СуммаПРКт,
	|	ХозрасчетныйДвиженияССубконто.СуммаВРДт КАК СуммаВРДт,
	|	ХозрасчетныйДвиженияССубконто.СуммаВРКт КАК СуммаВРКт,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт1 КАК СубконтоКт1,
	|	ХозрасчетныйДвиженияССубконто.СчетКт КАК СчетКт,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	|	ХозрасчетныйДвиженияССубконто.СубконтоДт3 КАК СубконтоДт3,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	|	ХозрасчетныйДвиженияССубконто.СубконтоКт3 КАК СубконтоКт3,
	|	ХозрасчетныйДвиженияССубконто.Содержание КАК Содержание,
	|	ЕСТЬNULL(ВТ_Операции.Ссылка, ЗНАЧЕНИЕ(Документ.ОперацияБух.ПустаяСсылка)) КАК СсылкаОперации
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(, , , , ) КАК ХозрасчетныйДвиженияССубконто
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Операции КАК ВТ_Операции
	|		ПО ХозрасчетныйДвиженияССубконто.Регистратор = ВТ_Операции.Документ
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.Регистратор) = ТИП(Документ.АмортизацияОС2_4)
	|	И ХозрасчетныйДвиженияССубконто.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ХозрасчетныйДвиженияССубконто.СубконтоКт1 В(&СписокОсновныхСредств)
	|ИТОГИ
	|	МАКСИМУМ(СсылкаОперации)
	|ПО
	|	Регистратор";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	МассивОсновныхСредств = Новый Массив;
	Для Каждого СтрокаОС Из Объект.ОсновныеСредства Цикл    
		Если СтрокаОС.Пометка Тогда  
			МассивОсновныхСредств.Добавить(СтрокаОС.ОсновноеСредство);
		КонецЕсли;
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокОсновныхСредств", МассивОсновныхСредств);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПоРегистратору = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Пока ВыборкаПоРегистратору.Следующий() Цикл  
			Если ЗначениеЗаполнено(ВыборкаПоРегистратору.СсылкаОперации) Тогда
				ОбщегоНазначения.СообщитьПользователю("По документу " + ВыборкаПоРегистратору.Регистратор + " уже создана " + ВыборкаПоРегистратору.СсылкаОперации, ВыборкаПоРегистратору.СсылкаОперации);
			Иначе
				ОперацияОбъект = Документы.ОперацияБух.СоздатьДокумент();
				ОперацияОбъект.Дата = КонецМесяца(Объект.Дата);
				ОперацияОбъект.Организация = Объект.Организация;   
				ОперацияОбъект.Ответственный = Пользователи.ТекущийПользователь();
				ОперацияОбъект.Содержание = НСтр("ru = 'Корректировка документа'" + ВыборкаПоРегистратору.Регистратор);
				ОперацияОбъект.Комментарий = "Создано автоматически из обработки ""Создание корректировок движения по ОС и ИНВ (тн)"" за " +  Формат(Объект.Дата, "ДФ='MMMM yyyy ''г.'''");
				Попытка
					ОперацияОбъект.Записать();
					НоваяСтрока = ОперацияОбъект.ЗаполнениеДвижений.Добавить();
					НоваяСтрока.Документ = ВыборкаПоРегистратору.Регистратор; 
					
					ВыборкаДетальныеЗаписи = ВыборкаПоРегистратору.Выбрать();  
					СторнируемыйНаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
					СторнируемыйНаборЗаписей.Отбор.Регистратор.Установить(ОперацияОбъект.Ссылка);
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ДвижениеСторно = СторнируемыйНаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(ДвижениеСторно, ВыборкаДетальныеЗаписи,,"Период,Регистратор");
						ДвижениеСторно.СуммаПРДт = ВыборкаДетальныеЗаписи.СуммаВРДт;
						ДвижениеСторно.СуммаПРКт = ВыборкаДетальныеЗаписи.СуммаВРКт;
						ДвижениеСторно.СуммаВРДт = - ВыборкаДетальныеЗаписи.СуммаВРДт;
						ДвижениеСторно.СуммаВРКт = - ВыборкаДетальныеЗаписи.СуммаВРКт;
						ДвижениеСторно.Период    =  КонецМесяца(Объект.Дата);
						ДвижениеСторно.Регистратор =  ОперацияОбъект.Ссылка; 
						
						БухгалтерскийУчет.УстановитьСубконто(ДвижениеСторно.СчетКт,  ДвижениеСторно.СубконтоКт,  1, ВыборкаДетальныеЗаписи.СубконтоКт1);
						БухгалтерскийУчет.УстановитьСубконто(ДвижениеСторно.СчетКт,  ДвижениеСторно.СубконтоКт,  2, ВыборкаДетальныеЗаписи.СубконтоКт2); 
						БухгалтерскийУчет.УстановитьСубконто(ДвижениеСторно.СчетКт,  ДвижениеСторно.СубконтоКт,  3, ВыборкаДетальныеЗаписи.СубконтоКт3); 
						
						БухгалтерскийУчет.УстановитьСубконто(ДвижениеСторно.СчетДт,  ДвижениеСторно.СубконтоДт,  1, ВыборкаДетальныеЗаписи.СубконтоДт1);
						БухгалтерскийУчет.УстановитьСубконто(ДвижениеСторно.СчетДт,  ДвижениеСторно.СубконтоДт,  2, ВыборкаДетальныеЗаписи.СубконтоДт2); 
						БухгалтерскийУчет.УстановитьСубконто(ДвижениеСторно.СчетДт,  ДвижениеСторно.СубконтоДт,  3, ВыборкаДетальныеЗаписи.СубконтоДт3); 					
					КонецЦикла;			
					СторнируемыйНаборЗаписей.Записать();			
					ОперацияОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
					ОбщегоНазначения.СообщитьПользователю("Сформирован документ: " + ОперацияОбъект, ОперацияОбъект); 
				Исключение				
					
					ТекстОшибки = "Документ " + ОперацияОбъект +":" + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
					ЗаписьЖурналаРегистрации("Обработка ""Создание корректировок движения по ОС и ИНВ (тн)""", УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
					ОбщегоНазначения.СообщитьПользователю("Возникли ошибки при корректировке движения по ОС и ИНВ:" + ТекстОшибки);		
					ОтменитьТранзакцию();
				КонецПопытки; 
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОперация(Команда)
	СоздатьОперацияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	УстановитьОтметкиОбъектовЭксплуатации(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьОтметкиОбъектовЭксплуатации(Ложь);
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура УстановитьОтметкиОбъектовЭксплуатации(Отметка)
	Для каждого СтрокаОбъекты Из Объект.ОсновныеСредства Цикл
		СтрокаОбъекты.Пометка = Отметка;
	КонецЦикла; 	
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПараметрыФормыВыбораПериода = Новый Структура("Значение, РежимВыбораПериода", Объект.Дата, "МЕСЯЦ");
	ОткрытьФорму("ОбщаяФорма.ВыборПериода",
		ПараметрыФормыВыбораПериода, 
		ЭтотОбъект, 
		УникальныйИдентификатор,,, 
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииРегулирование(Элемент, Направление, СтандартнаяОбработка)
	
	Модифицированность = Истина;
	
	ПериодРегистрации = НачалоМесяца(Объект.Дата);
	ОбщегоНазначенияУТКлиент.РегулированиеПредставленияПериодаРегистрации(Направление,
		СтандартнаяОбработка,
		ПериодРегистрации,
		ПредставлениеПериодаРегистрации);
		
	Объект.Дата = ПериодРегистрации;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры 

#КонецОбласти

&НаКлиенте
Процедура ПредставлениеПериодаРегистрацииНачалоВыбораЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт 
	
	Если ВыбранныйПериод <> Неопределено Тогда
		Модифицированность = Истина;
		Объект.Дата = КонецМесяца(ВыбранныйПериод);
		ПредставлениеПериодаРегистрации = ОбщегоНазначенияУТКлиентСервер.ПолучитьПредставлениеПериодаРегистрации(Объект.Дата);
		Объект.ОсновныеСредства.Очистить();

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.ОсновныеСредства.Очистить();
КонецПроцедуры
